{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 5,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_2",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.1.2-tf"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": true,
  "conv2d_same_offset_depth_2": true,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      4,
      1,
      1
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "output_shapes": [
    [
      3,
      1,
      1
    ]
  ],
  "separable_conv2d_same_offset_depth_1": true,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            4,
            1,
            1
          ],
          "values": [
            "aHIeP7er0D5FJe0+Ti/HPg=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            3,
            1,
            1
          ],
          "values": [
            "h6m8PgFHvz54D4Q+"
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "dense_1": {
      "bias": [
        "AAAAABrQhrwAAAAAAAAAAOpoh7w="
      ],
      "weights": [
        "4p5PP7rR4b7ULZ0+QD0Av1K/OT7Mmyg/rBMIPzReyj4cEw6/m6/XPr1KMb+fbf89kMLRPtzZE7+VP1i8lM8vvzS/Dj9w4zC/OBSoPjMBnb4="
      ]
    },
    "dense_2": {
      "bias": [
        "gOGGPLPYh7wHdYg8"
      ],
      "weights": [
        "sNk5vW4QVb/RJh2/1AERPvdC7D59xHe+cAZpPc1aLj/4q5++OMx+vgCgsLgOZJk+1i4fPrT8Hb78RcC+"
      ]
    }
  }
}
